# SELECT basics
world

In [1]:
import pandas as pd

In [2]:
pd.read_clipboard()

          name continent       area  population           gdp
0  Afghanistan      Asia   652230.0  25500100.0  2.034300e+10
1      Albania    Europe    28748.0   2831741.0  1.296000e+10
2      Algeria    Africa  2381741.0  37100000.0  1.886810e+11
3      Andorra    Europe      468.0     78115.0  3.712000e+09
4       Angola    Africa  1246700.0  20609294.0  1.009900e+11
5         ....       NaN        NaN         NaN           NaN

1. The example uses a WHERE clause to show the population of 'France'. Note that strings (pieces of text that are data) should be in 'single quotes';

Modify it to show the population of Germany

`SELECT population FROM world
  WHERE name = 'France'`

> `SELECT population FROM world
  WHERE name = 'Germany'`

2. Checking a list: The word IN allows us to check if an item is in a list. The example shows the name and population for the countries 'Brazil', 'Russia', 'India' and 'China'.

Show the name and the population for 'Sweden', 'Norway' and 'Denmark'.

`SELECT name, population FROM world
  WHERE name IN ('Brazil', 'Russia', 'India', 'China');`

> `SELECT name, population FROM world
  WHERE name IN ('Sweden', 'Norway', 'Denmark');`

3. Which countries are not too small and not too big? BETWEEN allows range checking (range specified is inclusive of boundary values). The example below shows countries with an area of 250,000-300,000 sq. km. Modify it to show the country and the area for countries with an area between 200,000 and 250,000.

`SELECT name, area FROM world
  WHERE area BETWEEN 250000 AND 300000`

> `SELECT name, area FROM world
  WHERE area BETWEEN 200000 AND 250000`

# SELECT Quiz

In [3]:
pd.read_clipboard()

          name       region       area  population           gdp
0  Afghanistan   South Asia   652225.0  26000000.0           NaN
1      Albania       Europe    28728.0   3200000.0  6.656000e+09
2      Algeria  Middle East  2400000.0  32900000.0  7.501200e+10
3      Andorra       Europe      468.0     64000.0           NaN
4          ...          NaN        NaN         NaN           NaN

1. Select the code which produces this table

In [4]:
pd.read_clipboard()

          name  population
0      Bahrain     1234571
1    Swaziland     1220000
2  Timor-Leste     1066409

> `SELECT name, population
  FROM world
 WHERE population BETWEEN 1000000 AND 1250000`
 
2. Pick the result you would obtain from this code:
`SELECT name, population
FROM world
WHERE name LIKE 'Al%'

> Table E

| name | population |
| ---- | ---------- |
| Albania | 3200000 |
| Algeria | 32900000 |

3. Select the code which shows the countries that end in A or L

> ``SELECT name FROM world
 WHERE name LIKE '%a' OR name LIKE '%l'
 
4. Pick the result from the query
`SELECT name,length(name)
FROM world
WHERE length(name)=5 and continent='Europe'`

In [2]:
pd.read_clipboard()

    name  length(name)
0  Italy             5
1  Malta             5
2  Spain             5

5. Here are the first few rows of the world table:

In [4]:
pd.read_clipboard()

          name       region       area  population           gdp
0  Afghanistan   South Asia   652225.0  26000000.0           NaN
1      Albania       Europe    28728.0   3200000.0  6.656000e+09
2      Algeria  Middle East  2400000.0  32900000.0  7.501200e+10
3      Andorra       Europe      468.0     64000.0           NaN
4          ...          NaN        NaN         NaN           NaN

Pick the result you would obtain from this code:
`SELECT name, area*2 FROM world WHERE population = 64000`

> | name | area*2 | 
| ----- | ------ |
| Andorra | 936 |

6. Select the code that would show the countries with an area larger than 50000 and a population smaller than 10000000

> `SELECT name, area, population
  FROM world
 WHERE area > 50000 AND population < 10000000`

7. Select the code that shows the population density of China, Australia, Nigeria and France

> `SELECT name, population/area
  FROM world
 WHERE name IN ('China', 'Nigeria', 'France', 'Australia')`

***
# SELECT FROM world Tutorial
In this tutorial you will use the SELECT command on the table world:

In [5]:
pd.read_clipboard()

          name continent       area  population           gdp
0  Afghanistan      Asia   652230.0  25500100.0  2.034300e+10
1      Albania    Europe    28748.0   2831741.0  1.296000e+10
2      Algeria    Africa  2381741.0  37100000.0  1.886810e+11
3      Andorra    Europe      468.0     78115.0  3.712000e+09
4       Angola    Africa  1246700.0  20609294.0  1.009900e+11
5          ...      None        NaN         NaN           NaN

## Examples
### Using SUM, Count, MAX, DISTINCT and ORDER BY.

#### BBC Country Profile

##### Aggregates
The functions `SUM`, `COUNT`, `MAX` and `AVG` are "aggregates", each may be applied to a numeric attribute resulting in a single row being returned by the query. (These functions are even more useful when used with the `GROUP BY` clause.)

##### Distinct
By default the result of a `SELECT` may contain duplicate rows. We can remove these duplicates using the `DISTINCT` key word.

##### Order by
`ORDER BY` permits us to see the result of a `SELECT` in any particular order. We may indicate `ASC` or `DESC` for ascending (smallest first, largest last) or descending order.

1. The total population and GDP of Europe.

> `SELECT SUM(population), SUM(gdp)
  FROM bbc
  WHERE region = 'Europe'`

2. What are the regions?

> `SELECT DISTINCT region FROM bbc`

3. Show the name and population for each country with a population of more than 100000000. Show countries in descending order of population.

> `SELECT name, population
  FROM bbc
  WHERE population > 100000000
  ORDER BY population DESC`
  
### Using GROUP BY and HAVING
#### World Country Profile

##### GROUP BY
By including a `GROUP BY` clause, functions such as `SUM` and `COUNT` are applied to groups of items sharing values. When you specify `GROUP BY` `continent` the result is that you get only one row for each different value of `continent`. All the other columns must be "aggregated" by one of `SUM`, `COUNT` ...

##### HAVING
The `HAVING` clause allows use to filter the groups which are displayed. The `WHERE` clause filters rows before the aggregation, the `HAVING` clause filters after the aggregation.

If an `ORDER BY` clause is included we can refer to columns by their position.

1. For each continent show the number of countries:

> `SELECT continent, COUNT(name)
  FROM world
 GROUP BY continent`

2. For each continent show the total population:

> `SELECT continent, SUM(population)
  FROM world
 GROUP BY continent`

3. `WHERE` and `GROUP BY`. The `WHERE` filter takes place before the aggregating function. For each relevant continent show the number of countries that has a population of at least 200000000.

> `SELECT continent, COUNT(name)
  FROM world
 WHERE population>200000000
 GROUP BY continent`

4. `GROUP BY` and `HAVING`. The `HAVING` clause is tested after the `GROUP BY`. You can test the aggregated values with a `HAVING` clause. Show the total population of those continents with a total population of at least half a billion.

> `SELECT continent, SUM(population)
  FROM world
 GROUP BY continent
HAVING SUM(population)>500000000`

***

# SUM and COUNT
### World Country Profile: Aggregate functions
This tutorial is about aggregate functions such as COUNT, SUM and AVG. An aggregate function takes many values and delivers just one value. For example the function SUM would aggregate the values 2, 4 and 5 to deliver the single value 11.

`world(name, continent, area, population, gdp)
`

In [2]:
pd.read_clipboard()

          name continent       area  population           gdp
0  Afghanistan      Asia   652230.0  25500100.0  2.034300e+10
1      Albania    Europe    28748.0   2831741.0  1.296000e+10
2      Algeria    Africa  2381741.0  37100000.0  1.886810e+11
3      Andorra    Europe      468.0     78115.0  3.712000e+09
4       Angola    Africa  1246700.0  20609294.0  1.009900e+11
5          ...      None        NaN         NaN           NaN

1. Show the total `population` of the world.

> `SELECT SUM(population)
FROM world`

2. List all the continents - just once each.
> `SELECT DISTINCT continent
FROM world;`

3. Give the total GDP of Africa
> `SELECT SUM(gdp)
FROM world
WHERE continent = 'Africa'
GROUP BY continent;`

4. How many countries have an `area` of at least 1000000?
>`SELECT COUNT(name)
FROM world
WHERE area >= 1000000;`

5. What is the total `population` of ('Estonia', 'Latvia', 'Lithuania')?
> `SELECT SUM(population)
FROM world
WHERE name IN ('Estonia', 'Latvia', 'Lithuania');`

6. For each `continent` show the `continent` and number of countries.
> `SELECT continent, COUNT(name)
FROM world
GROUP BY continent;`

7. For each `continent` show the `continent` and number of countries with populations of at least 10 million.
> `SELECT continent, COUNT(name)
FROM world
WHERE population >= 10000000
GROUP BY continent;`

8. List the continents that `have` a total population of at least 100 million.
> `SELECT continent
FROM world
GROUP BY continent
HAVING SUM(population) >= 100000000;`

# SUM and COUNT Quiz
bbc

In [3]:
pd.read_clipboard()

          name       region       area  population           gdp
0  Afghanistan   South Asia   652225.0  26000000.0           NaN
1      Albania       Europe    28728.0   3200000.0  6.656000e+09
2      Algeria  Middle East  2400000.0  32900000.0  7.501200e+10
3      Andorra       Europe      468.0     64000.0           NaN
4          ...          NaN        NaN         NaN           NaN

1. Select the statement that shows the sum of population of all countries in 'Europe'

> ` SELECT SUM(population) FROM bbc WHERE region = 'Europe'`

2. Select the statement that shows the number of countries with population smaller than 150000
> ` SELECT COUNT(name) FROM bbc WHERE population < 150000`

3. Select the list of core SQL aggregate functions
> `AVG(), COUNT(), MAX(), MIN(), SUM()`

4. Select the result that would be obtained from the following code:
` SELECT region, SUM(area)
   FROM bbc 
  WHERE SUM(area) > 15000000 
  GROUP BY region`
  
> No result due to invalid use of the WHERE function
(need to use HAVING function instead)

5. Select the statement that shows the average population of 'Poland', 'Germany' and 'Denmark'
> ` SELECT AVG(population) FROM bbc WHERE name IN ('Poland', 'Germany', 'Denmark')`

6. Select the statement that shows the medium population density of each region
> ` SELECT region, SUM(population)/SUM(area) AS density FROM bbc GROUP BY region`

7. Select the statement that shows the name and population density of the country with the largest population
> ` SELECT name, population/area AS density FROM bbc WHERE population = (SELECT MAX(population) FROM bbc)`

8. Pick the result that would be obtained from the following code:
` SELECT region, SUM(area) 
   FROM bbc 
  GROUP BY region 
  HAVING SUM(area)<= 20000000`
  
> | region | SUM(area) |
| --------| ---------- |
| Americas | 732240 |
| Middle East | 13403102 |
| South America | 17740392 |
| South Asia | 9437710 |